'''   Домашнее задание 1:

1.1
1) Установите Python и PyCharm
2) Напишите и запустите программу. которая выводит строку  "Hello world!"
3) Напишите программу, которая на входе получает имя пользователя, cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"
4) Напишите программу, которая на входе получает 2 числа, производит с ними арифметическую операцию(на ваше усмотрение), и выводит “Результат = {результат}”.

1.2
1) Напишите программу, чтобы вывести:

* ** ** ** **
*           *
*           *
* ** ** ** **

'''

# print(f'Hello, World!')




# user_name = input('Введите имя пользователя: ')
# print(f'Hello, {user_name}!')



# num1 = 5
# num2 = 7
# num1 = int(input('Первое число: '))
# num2 = int(input('Второе число: '))
# num1 = int(input('Первое число: '))
# result = num1 + num2

# print(f'Результат: {result}')
# print(f'Результат: ', num1 + num2)

#
#
# print('** ** ** ** **')
# print('*            *')
# print('*            *')
# print('*            *')
# print('** ** ** ** **')
#
#
#
# print('**********\n*        *\n*        *\n**********')
#
#
#
# print('''0123456789
# 0        9
# 0        9
# 0123456789''')
#
#
#
#
# print("""
# *********
# *       *
# *       *
# *********
# """)
#
#
#
# print('*' * 9)
# print('*' + " " * 7 + "*")
# print('*' + " " * 7 + "*")
# print('*' * 9)

